; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph7 - mode
	spectrograph10 - mode
	image9 - mode
	image6 - mode
	spectrograph5 - mode
	spectrograph1 - mode
	infrared8 - mode
	infrared2 - mode
	infrared3 - mode
	image0 - mode
	spectrograph4 - mode
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared2)
	(supports instrument0 image6)
	(supports instrument0 image9)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared3)
	(supports instrument1 infrared8)
	(supports instrument1 spectrograph5)
	(supports instrument1 spectrograph10)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Planet5 infrared3)
	(have_image Planet6 infrared2)
	(have_image Planet6 spectrograph4)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon7 spectrograph4)
	(have_image Phenomenon7 spectrograph5)
	(have_image Star8 infrared2)
	(have_image Planet9 infrared8)
	(have_image Planet9 spectrograph10)
	(have_image Star10 spectrograph7)
	(have_image Star10 infrared2)
	(have_image Star10 infrared8)
	(have_image Planet11 spectrograph1)
	(have_image Planet11 image0)
	(have_image Planet11 infrared8)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 16
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 16
3. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 16
4. (turn_to satellite0 planet6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet6)
   goals met: 0 of 16
5. (take_image satellite0 planet6 instrument1 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 1 of 16
6. (turn_to satellite0 planet5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet5)
   goals met: 1 of 16
7. (take_image satellite0 planet5 instrument1 infrared3)
   added: (have_image planet5 infrared3)
   goals met: 2 of 16
8. (turn_to satellite0 planet11 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet11)
   goals met: 2 of 16
9. (take_image satellite0 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 3 of 16
10. (take_image satellite0 planet11 instrument1 infrared8)
   added: (have_image planet11 infrared8)
   goals met: 4 of 16
11. (turn_to satellite0 phenomenon7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 16
12. (take_image satellite0 phenomenon7 instrument1 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 5 of 16
13. (take_image satellite0 phenomenon7 instrument1 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 6 of 16
14. (turn_to satellite0 planet9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet9)
   goals met: 6 of 16
15. (take_image satellite0 planet9 instrument1 infrared8)
   added: (have_image planet9 infrared8)
   goals met: 7 of 16
16. (take_image satellite0 planet9 instrument1 spectrograph10)
   added: (have_image planet9 spectrograph10)
   goals met: 8 of 16
17. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 8 of 16
18. (take_image satellite0 star10 instrument1 infrared8)
   added: (have_image star10 infrared8)
   goals met: 9 of 16
19. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 9 of 16
20. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 9 of 16
21. (turn_to satellite0 star0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star0)
   goals met: 9 of 16
22. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 9 of 16
23. (turn_to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   goals met: 9 of 16
24. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   goals met: 10 of 16
25. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 10 of 16
26. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 11 of 16
27. (turn_to satellite0 planet6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet6)
   goals met: 11 of 16
28. (take_image satellite0 planet6 instrument0 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 12 of 16
29. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 12 of 16
30. (take_image satellite0 star10 instrument0 infrared2)
   added: (have_image star10 infrared2)
   goals met: 13 of 16
31. (take_image satellite0 star10 instrument0 spectrograph7)
   added: (have_image star10 spectrograph7)
   goals met: 14 of 16
32. (turn_to satellite0 star8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star8)
   goals met: 14 of 16
33. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   goals met: 15 of 16
34. (turn_to satellite0 star3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star3)
   goals met: 16 of 16
